app/views/tags/show.html.erb

SELECT "boards".* FROM "boards" INNER JOIN "boards_tags" ON "boards"."id" = "boards_tags"."board_id" WHERE "boards_tags"."tag_id" = $1  [["tag_id", 12]]
SELECT  1 AS one FROM "boards" INNER JOIN "boards_tags" ON "boards"."id" = "boards_tags"."board_id" WHERE "boards_tags"."tag_id" = $1 LIMIT $2  [["tag_id", 4], ["LIMIT", 1]]
---

<% if @tag.boards.empty? %>