app/views/boards/_board.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."board_id" = $1  [["board_id", 2]]
---
            <section class="footer-summary">
              <%= raw board.tags.map(&:name).map{ |t| link_to t, tag_path(t), class: 'badge badge-info' }.join(' ') %>