app/views/boards/_board.html.erb

        <section class="footer-summary">
          <%= raw board.tags.map(&:name).map { |t| link_to t, tag_path(t), class: 'badge badge-info' }.join(' ') %>
---
SELECT "tags".* FROM "tags" INNER JOIN "boards_tags" ON "tags"."id" = "boards_tags"."tag_id" WHERE "boards_tags"."board_id" = $1  [["board_id", 1]]