app/views/boards/_form.html.erb

SELECT "users".* FROM "users"
---
      <%#= @users.each do |user| ?!?!? %>
      <%= User.all.each do |user| %>