app/views/boards/index.html.erb


						<%= raw board.tags.map(&:name).map { |t| link_to t, tag_path(t), class: 'badge badge-success' }.join(' ') %>
---
SELECT "tags".* FROM "tags" INNER JOIN "boards_tags" ON "tags"."id" = "boards_tags"."tag_id" WHERE "boards_tags"."board_id" = $1  [["board_id", 1]]