app/views/boards/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."board_id" = $1  [["board_id", 12]]
---

<% @board.comments.each do |comment| %>