app/views/boards/show.html.erb

SELECT "comments".* FROM "comments" INNER JOIN "boards_comments" ON "comments"."id" = "boards_comments"."comment_id" WHERE "boards_comments"."board_id" = $1  [["board_id", 1]]
---
<hr>
<% @board.comments.each do |comment| %>