app/views/searches/show.html.erb

SELECT  1 AS one FROM "boards" WHERE (title LIKE '%Tesla Model%') AND (author LIKE 'Thomas Middleditch') LIMIT $1  [["LIMIT", 1]]
SELECT "boards".* FROM "boards" WHERE (author LIKE '123123')
---

<% if @search.search_boards.empty? %>

SELECT "boards".* FROM "boards" WHERE (title LIKE '%Tesla %') AND (body LIKE '%Tesla %')
---

	<% @search.search_boards.each do |c| %>