app/controllers/board_controller.rb

  def index
    @board = Post.all
---
SELECT "posts".* FROM "posts"