app/controllers/boards_controller.rb

  def index
    #@boards = Board.all

    @boards = Board.search(params[:search])
---
SELECT "boards".* FROM "boards" WHERE (title LIKE '%11%')

  def new
    @board = Board.new

    #Свяжем авторизованного юзера и новое объявление
    #@users = User.all
    @user_options = User.all.map{|u| [ u.name, u.id ] }
---
SELECT "users".* FROM "users"

  def create

    @board = Board.new(board_params)

    @board.user = current_user

    respond_to do |format|
      if @board.save
---
INSERT INTO "boards" ("title", "body", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ""], ["body", ""], ["created_at", "2019-01-25 12:14:18.424767"], ["updated_at", "2019-01-25 12:14:18.424767"], ["user_id", 2]]

  def update
    respond_to do |format|
      if @board.update(board_params)
---
UPDATE "boards" SET "author" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["author", "Jerry Smith"], ["updated_at", "2019-01-28 08:34:47.194459"], ["id", 2]]

  def destroy
    @board.destroy
---
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 1]]