app/controllers/comments_controller.rb

SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "rdte"], ["body", "tert"], ["board_id", 12], ["created_at", "2019-01-24 08:13:17.139834"], ["updated_at", "2019-01-24 08:13:17.139834"]]
---
	def create
		@board = Board.find(params[:board_id])
		comment = @board.comments.create(comment_params)