app/controllers/searches_controller.rb

  def new
    @search = Search.new
    #Выбираем объвление в определенном теге, но без дублирования
    @author = Board.pluck(:author).uniq
---
SELECT "boards"."author" FROM "boards"