app/controllers/searches_controller.rb

SELECT "boards"."tag" FROM "boards"
---
	def new
		@search = Search.new

		#Выбираем объвление в определенном теге, но без дублирования
		@tags = Board.pluck(:tag).uniq

INSERT INTO "searches" ("keywords", "author", "created_at", "updated_at", "body") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["keywords", ""], ["author", ""], ["created_at", "2019-01-28 11:52:32.833887"], ["updated_at", "2019-01-28 11:52:32.833887"], ["body", "Tesla Model 3"]]
---
	def create
		@search = Search.create(search_params)

SELECT  "searches".* FROM "searches" WHERE "searches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		@search = Search.find(params[:id])