app/models/board.rb

	def all_tags
		self.tags.map(&:name).join(', ')
---
SELECT "tags".* FROM "tags" INNER JOIN "boards_tags" ON "tags"."id" = "boards_tags"."tag_id" WHERE "boards_tags"."board_id" = $1  [["board_id", 1]]

	def all_tags=(names)
		#Добавляем теги к посту
		self.tags = names.split(',').map do |name|
			#Ищеи тег по имени
			Tag.where(name: name.strip).first_or_create!
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."board_id" = $1  [["board_id", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "xk"], ["created_at", "2019-01-28 04:50:42.192130"], ["updated_at", "2019-01-28 04:50:42.192130"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 ORDER BY "tags"."id" ASC LIMIT $2  [["name", "xk"], ["LIMIT", 1]]